# Задача со ЗВЁЗДОЧКОЙ. Решать НЕ обязательно.
# Программа получает на вход натуральное число num.
# Программа должна вывести другое натуральное число, удовлетворяющее условиям:
# Новое число должно отличаться от данного ровно одной цифрой
# Новое число должно столько же знаков как исходное
# Новое число должно делиться на 3
# Новое число должно быть максимально возможным из всех таких чисел
# Например (Ввод --> Вывод) :
#
# 379 --> 879
# 15 --> 75
# 4974 --> 7974

def max_division_by_3(num):
    """Преобразование числа
    :param num: натуральное число
    :return: другое натуральное число, удовлетворяющее условиям
    """
    # todo Здесь нужно написать код
    list_of_numbers = [int(i) for i in str(num)]  # список из цифр числа
    index_of_number = 0  # индекс подбираемого числа
    final_list = []  # пустой список для хранения новых чисел
    for b in range(1, len(list_of_numbers) + 1):  # перебираем каждую цифру числа
        list_of_numbers_copy = list_of_numbers.copy()  # работаем с копией списка чтобы не менять исходный
        for enumeration in range(1, 10):  # перебираем все цифры заменяя заданное значение
            list_of_numbers_copy[index_of_number] = enumeration
            if sum(list_of_numbers_copy) % 3 == 0:  # если делится на 3 без остатка, то добавляем в список
                line_for = ''
                for collect_number in list_of_numbers_copy:
                    # собираем отдельные числа списка в строку и преобразуем в число.
                    line_for += str(collect_number)
                final_list += [int(line_for)]
            else:
                continue
        index_of_number += 1
    if final_list.count(num) != 0:
        # удаляем все вхождения входного значения из списка (почему не 1 раз? потому что для 333 и подобных,
        # может быть несколько вхождений)
        for i in range(final_list.count(num)):
            final_list.remove(num)
    return max(final_list)

# Ниже НИЧЕГО НЕ НАДО ИЗМЕНЯТЬ


data = [
    379, 810, 981, 4974, 996, 9000, 15, 0, 9881, 9984, 9876543210, 98795432109879543210
]

test_data = [
    879, 870, 987, 7974, 999, 9900, 75, 9, 9981, 9987, 9879543210, 98798432109879543210
]


for i, d in enumerate(data):
    assert max_division_by_3(d) == test_data[i], f'С набором {d} есть ошибка, не проходит проверку'
    print(f'Тестовый набор {d} прошёл проверку')
print('Всё ок')